package com.kh.chap01_list.part01.run;

public class ListRun {

	/*
	 * * 컬렉션
	 *  - 자료구조 개념이 내장되어있는 클래스로 자바에서 제공하는 "자료구조"를 담당하는 "프레임워크"
	 *  
	 *  - 자료구조: 방대한 데이터를 보다 효율적으로 관리(조회, 정렬, 추가, 수정, 삭제)할 수 있도록 도와주는 개념
	 *  - 프레임워크: 이미 만들어져있는 틀(뼈대) => 그냥 가져다쓰면 됨
	 *  
	 * * 배열의 단점과 컬렉션의 장점
	 *  > 배열의 단점
	 *		1. 배열은 크기를 지정해야함. 한 번 지정된 크기를 변경할 수 없음
	 *		   새로운 값을 더 추가하고자하면 새로운 크기의 배열을 만들고 기존 배열을 복사하는 코드를 직접 기술
	 *
	 *		2. 배열 중간에 추가한다거나 삭제하는 경우 매번 땡겨주는 복잡한 알고리즘을 직접 기술해야함.
	 *	
	 *  > 컬렉션의 장점
	 *  	1. 크기를 지정해줄 필요가 없음. 지정했다고 하더라도 더 많은 데이터가 들어오면 알아서 사이즈를 늘려줌
	 *  	   => 크기의 제약이 없음
	 *  
	 *  	2. 중간에 값을 추가한다거나 삭제하는 경우 값을 땡겨주는 작업(알고리즘)을 직접 기술할 필요 없음
	 *  	   메소드 호출으로 내부적으로 알아서 진행됨
	 */
	
	public static void main(String[] args) {

	}

}
